hugo/public/emacs/simple-httpd/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>emacs 簡易 HTTPD 化パケージ simple-httpd.el - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/emacs/simple-httpd/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="emacs 簡易 HTTPD 化パケージ simple-httpd.el" />
<meta property="og:description" content="lctags(../../lctags/callgraph/) の インタラクティブなコールグラフ機能実現のため、 HTTPD として simple-httpd.el(https://github.com/skeeto/emacs-http-server) を利用しました。 simple-httpd.el についての日本語の情報があまり無かったため、 ここにまとめておき" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/emacs/simple-httpd/" /><meta property="article:section" content="emacs" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="emacs 簡易 HTTPD 化パケージ simple-httpd.el"/>
<meta name="twitter:description" content="lctags(../../lctags/callgraph/) の インタラクティブなコールグラフ機能実現のため、 HTTPD として simple-httpd.el(https://github.com/skeeto/emacs-http-server) を利用しました。 simple-httpd.el についての日本語の情報があまり無かったため、 ここにまとめておき"/>
<meta itemprop="name" content="emacs 簡易 HTTPD 化パケージ simple-httpd.el">
<meta itemprop="description" content="lctags(../../lctags/callgraph/) の インタラクティブなコールグラフ機能実現のため、 HTTPD として simple-httpd.el(https://github.com/skeeto/emacs-http-server) を利用しました。 simple-httpd.el についての日本語の情報があまり無かったため、 ここにまとめておき">

<meta itemprop="wordCount" content="1683">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/contents/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>emacs 簡易 HTTPD 化パケージ simple-httpd.el</h1>

<p>
lctags(<a href="../../lctags/callgraph/">../../lctags/callgraph/</a>) の
インタラクティブなコールグラフ機能実現のため、
HTTPD として simple-httpd.el(<a href="https://github.com/skeeto/emacs-http-server)">https://github.com/skeeto/emacs-http-server)</a> を利用しました。</p>
<p>
simple-httpd.el についての日本語の情報があまり無かったため、
ここにまとめておきます。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
simple-httpd.el とは
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
その名の通り、 emacs を シンプルな HTTPD とするための emacs lisp パケージです。</p>
<p>
これを利用することで、Web サービスを emacs で簡単に立ち上げられます。</p>
<p>
HTTPD には多くの実装がありますが、これを利用する最大の利点は</p>
<p>
<strong>「Web サービスと emacs との連携が容易に可能」</strong></p>
<p>
これに尽きるでしょう。</p>
<p>
これに魅力を感じなければ、
HTTPD として simple-httpd.el を採用する理由はほとんどないと言えます。</p>
<p>
simple-httpd.el の特徴には他にもありますが、
それは simple-httpd.el に特化したものではなく、
他の HTTPD にもあるものですので、
敢えて simple-httpd.el を選択することもないと思います。</p>
<p>
私が lctags の HTTPD として simple-httpd.el を選択したのも、
Web サービスと emacs との連携が容易に可能であることが一番です。</p>
<p>
例えば、 lctags のコールグラフで関数ノードを右クリックすると
その関数の定義場所を emacs で表示する、という機能が連携の例です。</p>
<p>
この連携機能を simple-httpd.el を使わずに実現するには、次の処理が必要になります。</p>
<ul>
<li>HTTPD は、受信したリクエストを解析する</li>
<li>HTTPD は、解析した情報から RPC 等で emacs に所定の関数の定義場所を開けと指示する</li>
<li>emacs は、指示された要求を処理し、関数定義場所を開く</li>
</ul>
<p>simple-httpd.el を利用することで、上記処理の大部分を省けます。</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
simple-httpd.el の利用方法
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
基本的には次のステップで利用可能です。  </p>
<ul>
<li><a href="https://github.com/skeeto/emacs-http-server">https://github.com/skeeto/emacs-http-server</a> を clone</li>
<li>(require &#39;simple-httpd)</li>
<li>(httpd-start)</li>
</ul>
<p>これによって、8080 ポートで HTTPD が待ち受けます。</p>
<p>
あとは PATH に対するサーブレット登録するだけです。</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
サーブレット登録
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
サーブレットの登録は (defservlet NAME MIME PATH-QUERY-REQUEST &amp;rest BODY) で
行ないます。</p>
<p>
例えば lctags では、次の登録をしています。</p>
<div class="src src-lisp">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-lisp" data-lang="lisp"><span class="line"><span class="cl"><span class="p">(</span><span class="nv">defservlet</span> <span class="nv">lctags</span> <span class="nv">text/json</span> <span class="p">(</span><span class="nv">path</span> <span class="nv">query</span> <span class="nv">req</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nv">lctags-servlet-gen</span> <span class="s">&#34;/lctags/gen/index.html&#34;</span> <span class="nv">query</span> <span class="nv">req</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
これは、</p>
<ul>
<li>
<p>NAME パラメータとして lctags を指定。</p>
<ul>
<li>これにより、HTTPD に <a href="http://?????????:8080/lctags">http://?????????:8080/lctags</a> にサーブレットを登録できます。</li>
</ul>
</li>
<li>
<p>MIME パラメータとして text/json を指定。</p>
<ul>
<li>これはレスポンスに利用するデフォルトの Content-Type です。</li>
<li>あくまでデフォルトであり、後で別の Content-Type を指定出来ます。</li>
</ul>
</li>
<li>
<p>PATH-QUERY-REQUEST パラメータとして (path query req) を指定。</p>
<ul>
<li>path, query, req それぞれに、リクエストで指定された情報が格納されます。</li>
<li>query には URL の query が格納され、例えば <code>lctags?hoge=1&amp;foo=2</code> の場合
<code>((&#34;hoge&#34; &#34;1&#34;)(&#34;foo&#34; &#34;2))</code> が格納されます。</li>
<li>
<p>req には、HTTP HEADER などの情報が格納されます。</p>
<ul>
<li><code>((&#34;Host&#34; &#34;192.168.0.1:8080&#34;)(&#34;User-Agent&#34; &#34;hogehoge&#34;))</code></li>
</ul>
</li>
</ul>
</li>
<li>BODY パラメータとして、 (lctags-servlet-gen) を実行。</li>
</ul>
<p>
(defservlet) の BODY パラメータでは、次の処理を行ないます。</p>
<ul>
<li>レスポンスするデータを current-buffer に (insert) する</li>
<li>レスポンスする Content-Type、HTTP ヘッダ、HTTP ステータスを設定する (httpd-send-header)</li>
</ul>
<p>ちなみに、上記処理は必須ではありません。
何も処理しなければ、なにも処理しないサーブレットになります。</p>
<p>
Content-Type、HTTP ヘッダ、ステータスを設定しなければ、
defservlet で指定した MIME の Content-Type で、ステータス 200 がレスポンスされます。</p>
<p>
レスポンスは、(httpd-send-header) を実行したタイミングか、
(httpd-send-header) を実行しない場合は BODY 実行後のタイミングです。
よって、(httpd-send-header) を実行前に必ずレスポンスするデータを
(insert) しておく必要があります。</p>
<p>
このことからも分かるように、
simple-httpd.el では Transfer-Encoding に対応していません。
この辺りはあくまで simple ということなのでしょう。
まぁ、問題ないと思いますが。</p>
<p>
なお、httpd-send-header の引数は次の通りです。</p>
<div class="src src-lisp">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-lisp" data-lang="lisp"><span class="line"><span class="cl"><span class="p">(</span><span class="nv">httpd-send-header</span> <span class="nv">proc</span> <span class="nv">mime</span> <span class="nv">status</span> <span class="k">&amp;rest</span> <span class="nv">header-keys</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
その他の関数
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
(httpd-error PROC STATUS &amp;optional INFO)
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
サーブレットの BODY 中に実行することで、
指定した STATUS エラーをサーブレットのレスポンスとします。</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
(httpd-def-file-servlet NAME ROOT)
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
ローカルなファイルをそのままレスポンスするサーブレットが必要なことが
良くあります。
この関数は、そのサーブレットを登録するためのものです。</p>
<p>
NAME は URL のパスで、 ROOT はローカルディレクトリのパスです。</p>
<p>
この関数で登録した URL にアクセスすると、
Apache の Options Indexes 指定したような動作になります。</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
(httpd-get-mime EXT)
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
指定した EXT の拡張子に対応する MIME を返す。</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
(httpd-date-string &amp;optional DATE)
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
RFC 1123 の日付表記を返す。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
まとめ
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
simple-httpd.el を利用することで、
Web サービスと emacs との連携を容易に実現できます。</p>
<p>
ただ、具体的にどのような Web サービスを提供すれば
より良いユースケースが実現出来るかが難しいところでもあります。</p>
<p>
特に emacs は、 emacs で処理が閉じていることが善しとされることが多々あるので、
simple-httpd.el を使うユースケースというのは少ないのかもしれません。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/emacs/" title="Emacs"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - Emacs</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/emacs/company-mode/" title="自作言語 (LuneScript) の emacs company-mode backend 設定">Next - 自作言語 (LuneScript) の emacs company-mode backend 設定 <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class="active"><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
